[
    {
        "model": "meals.menuitem",
        "pk": 1,
        "fields": {
            "name": "Butter Chicken",
            "price": "250.00",
            "description": "Tender chunks of marinated chicken cooked in a rich, creamy tomato-based gravy infused with aromatic spices, butter, and fresh cream. A beloved North Indian classic that's perfectly balanced between sweet and savory.",
            "cuisine": "indian",
            "image": "menu_images/butter_chicken_4OuK5Yw.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 2,
        "fields": {
            "name": "Chicken Tikka Masala",
            "price": "240.00",
            "description": "Succulent pieces of grilled chicken tikka simmered in a velvety masala sauce made with tomatoes, cream, and a blend of traditional Indian spices. Each bite delivers smoky, tangy, and mildly spiced flavors.",
            "cuisine": "indian",
            "image": "menu_images/chicken_tikka_masala.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 3,
        "fields": {
            "name": "Masala Dosa",
            "price": "150.00",
            "description": "Golden, crispy South Indian crepe made from fermented rice and lentil batter, generously filled with a savory mixture of spiced potatoes, onions, and curry leaves. Served with coconut chutney and sambar.",
            "cuisine": "indian",
            "image": "menu_images/masala_dosa.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 4,
        "fields": {
            "name": "Chicken Biryani",
            "price": "220.00",
            "description": "Classic Hyderabad-style aromatic rice dish with tender marinated chicken pieces, fragrant basmati rice, fried onions, and a perfect blend of whole spices. Served with raita and traditionally cooked in the dum style.",
            "cuisine": "indian",
            "image": "menu_images/chicken_briani.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 5,
        "fields": {
            "name": "Rogan Josh",
            "price": "260.00",
            "description": "Authentic Kashmiri lamb curry featuring tender meat braised in a fragrant sauce of yogurt, garlic, ginger, and aromatic spices including Kashmiri chilies. The dish is known for its deep red color and rich, complex flavors.",
            "cuisine": "indian",
            "image": "menu_images/rojan_josh.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 6,
        "fields": {
            "name": "Vegetable Biryani",
            "price": "180.00",
            "description": "Fragrant basmati rice layered with fresh seasonal vegetables, caramelized onions, and aromatic spices including saffron, cardamom, and bay leaves. Slow-cooked to perfection for a flavorful vegetarian feast.",
            "cuisine": "indian",
            "image": "menu_images/veg_briani.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 7,
        "fields": {
            "name": "Mine Bouille",
            "price": "120.00",
            "description": "Traditional Mauritian comfort food featuring soft boiled noodles served in a flavorful broth, topped with your choice of vegetables, meat, or seafood. A beloved local favorite that's warm and satisfying.",
            "cuisine": "mauritian",
            "image": "menu_images/mine_bouille.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 8,
        "fields": {
            "name": "Boulette Soup",
            "price": "130.00",
            "description": "\"Comforting clear broth soup filled with tender steamed dumplings made from chayote or other vegetables, often accompanied by fried wonton wrappers. A beloved Sino-Mauritian dish perfect for any time of day.",
            "cuisine": "mauritian",
            "image": "menu_images/boulettes.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 9,
        "fields": {
            "name": "Fish Vindaye",
            "price": "180.00",
            "description": "Traditional Mauritian pickled fish dish where fresh fish is fried then cooked in a tangy mustard-based sauce with onions, garlic, ginger, and turmeric. Best enjoyed cold as a flavorful side dish or main course.",
            "cuisine": "mauritian",
            "image": "menu_images/fish_vindaye.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 10,
        "fields": {
            "name": "Mauritian Fried Rice",
            "price": "140.00",
            "description": "Fragrant wok-tossed rice stir-fried with scrambled eggs, fresh vegetables, soy sauce, and aromatic spices. This Mauritian version has its own unique blend of flavors influenced by Chinese, Indian, and Creole cuisines.",
            "cuisine": "mauritian",
            "image": "menu_images/fried_rice.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 11,
        "fields": {
            "name": "Mauritian Fried Noodles",
            "price": "160.00",
            "description": "Fragrant wok-tossed noodles stir-fried with scrambled eggs, fresh vegetables, soy sauce, and aromatic spices. This Mauritian version has its own unique blend of flavors influenced by Chinese, Indian, and Creole cuisines.",
            "cuisine": "mauritian",
            "image": "menu_images/fried_noodles.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 12,
        "fields": {
            "name": "Gateau Piment",
            "price": "30.00",
            "description": "Popular Mauritian snack of crispy fried chili cakes made with yellow split peas (dholl), fresh herbs, and fiery bird's eye chilies. Crunchy on the outside, soft inside, and packed with spicy flavor.",
            "cuisine": "mauritian",
            "image": "menu_images/gato_piment.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 13,
        "fields": {
            "name": "Fish and Chips",
            "price": "300.00",
            "description": "Classic British favorite featuring flaky white fish coated in a light, crispy beer batter, served with golden thick-cut chips. Accompanied by mushy peas, tartar sauce, and a lemon wedge for the authentic experience.",
            "cuisine": "english",
            "image": "menu_images/fish_and_chips.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 14,
        "fields": {
            "name": "Full English Breakfast",
            "price": "400.00",
            "description": "Hearty traditional breakfast spread including fried eggs, crispy bacon, pork sausages, baked beans, grilled tomatoes, sautΘed mushrooms, black pudding, and buttered toast. The perfect way to start your day.",
            "cuisine": "english",
            "image": "menu_images/Full_English_Breakfast.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 15,
        "fields": {
            "name": "Steak and Ale Pie",
            "price": "320.00",
            "description": "Traditional pub favorite with tender chunks of beef slow-cooked in rich ale gravy with onions and mushrooms, all encased in flaky golden pastry. Served piping hot with your choice of sides.",
            "cuisine": "english",
            "image": "menu_images/Steak_and_Ale_Pie.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 16,
        "fields": {
            "name": "Yorkshire Pudding",
            "price": "110.00",
            "description": "\"Light and airy baked batter pudding with a crispy golden exterior and soft center, traditionally served as part of a roast dinner. Made from a simple batter of eggs, flour, and milk.",
            "cuisine": "english",
            "image": "menu_images/Yorkshire_Pudding.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 17,
        "fields": {
            "name": "Bangers and Mash",
            "price": "220.00",
            "description": "Classic British comfort food featuring juicy pork sausages served on a bed of creamy, buttery, silky mashed potatoes, all smothered in rich onion gravy. Simple, hearty, and deeply satisfying.",
            "cuisine": "english",
            "image": "menu_images/Bangers_and_Mash.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 18,
        "fields": {
            "name": "Sunday Roast",
            "price": "750.00",
            "description": "Traditional Sunday feast with succulent roast beef, golden, crispy roast potatoes, Yorkshire pudding, seasonal vegetables, and lashings of rich gravy. A British institution that brings families together.",
            "cuisine": "english",
            "image": "menu_images/Sunday_Roast.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 19,
        "fields": {
            "name": "Cassoulet",
            "price": "320.00",
            "description": "Hearty slow-cooked casserole from southern France featuring white beans, duck confit, pork sausage, and herbs, topped with a golden breadcrumb crust. A rich, rustic dish perfect for cold weather.",
            "cuisine": "french",
            "image": "menu_images/Cassoulet.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 20,
        "fields": {
            "name": "Coq au Vin",
            "price": "290.00",
            "description": "Classic French braised chicken dish where tender chicken pieces are slow-cooked in red wine with mushrooms, pearl onions, bacon, and herbs until the meat falls off the bone. A countryside favorite.",
            "cuisine": "french",
            "image": "menu_images/Coq_au_Vin.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 21,
        "fields": {
            "name": "Creme Brulee",
            "price": "140.00",
            "description": "Luxurious French dessert featuring smooth, rich vanilla custard topped with a layer of caramelized sugar that cracks dramatically under your spoon. The perfect contrast of creamy and crunchy textures.",
            "cuisine": "french",
            "image": "menu_images/creme_brulee.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 22,
        "fields": {
            "name": "Nicoise Salad",
            "price": "190.00",
            "description": "Fresh and colorful salad from Nice featuring seared tuna, hard-boiled eggs, green beans, tomatoes, anchovies, and olives on a bed of crisp lettuce, dressed with olive oil and lemon. Light yet satisfying.",
            "cuisine": "french",
            "image": "menu_images/Nicoise_Salad.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 23,
        "fields": {
            "name": "Quiche Lorraine",
            "price": "270.00",
            "description": "Savory French tart featuring a buttery pastry crust filled with a silky custard mixture of eggs, cream, crispy bacon, and cheese. Served warm or at room temperature for breakfast, lunch, or light dinner.",
            "cuisine": "french",
            "image": "menu_images/Quiche_Lorraine.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 24,
        "fields": {
            "name": "Ratatouille",
            "price": "340.00",
            "description": "Vibrant Provenτal vegetable stew showcasing the best of summer produce including eggplant, zucchini, bell peppers, and tomatoes, slowly cooked with garlic, herbs, and olive oil until perfectly tender.",
            "cuisine": "french",
            "image": "menu_images/Ratatouille.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 25,
        "fields": {
            "name": "Sushi Platter",
            "price": "1200.00",
            "description": "A selection of fresh sushi including nigiri, maki rolls, and sashimi featuring premium seafood like salmon, tuna, and shrimp. Served with pickled ginger, wasabi, and soy sauce for an authentic Japanese experience.",
            "cuisine": "asian",
            "image": "menu_images/Sushi_platter.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 26,
        "fields": {
            "name": "Beef Bulgogi",
            "price": "630.00",
            "description": "Korean grilled beef marinated in a sweet and savory mixture of soy sauce, sesame oil, garlic, and pear, then grilled to caramelized perfection. Tender, flavorful, and slightly charred at the edges.",
            "cuisine": "asian",
            "image": "menu_images/Beef_Bulgogi.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 27,
        "fields": {
            "name": "Beef Ramen",
            "price": "310.00",
            "description": "Steaming bowl of authentic Japanese noodle soup with rich, savory broth simmered for hours, tender sliced beef, springy ramen noodles, soft-boiled egg, bamboo shoots, and fresh green onions. Comfort in a bowl.",
            "cuisine": "asian",
            "image": "menu_images/Beef_Ramen.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 28,
        "fields": {
            "name": "Chicken Teriyaki",
            "price": "470.00",
            "description": "Succulent grilled chicken glazed with sweet and savory teriyaki sauce made from soy sauce, mirin, and sugar. Served with steamed rice and vegetables for a balanced, flavorful Japanese meal.",
            "cuisine": "asian",
            "image": "menu_images/Chicken_Teriyaki.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 29,
        "fields": {
            "name": "Spring Rolls",
            "price": "190.00",
            "description": "Crispy golden fried rolls filled with a savory mixture of shredded vegetables, glass noodles, and seasonings, wrapped in thin pastry. Served hot with sweet chili sauce or soy-based dipping sauce.",
            "cuisine": "asian",
            "image": "menu_images/Spring_Rolls.jpg",
            "image_url": ""
        }
    },
    {
        "model": "meals.menuitem",
        "pk": 30,
        "fields": {
            "name": "Tempura Udon",
            "price": "350.00",
            "description": "Thick, chewy Japanese udon noodles served in a light, flavorful dashi broth, topped with an assortment of crispy, golden tempura-fried vegetables and shrimp. A satisfying combination of textures.",
            "cuisine": "asian",
            "image": "menu_images/Tempura_Udon.jpg",
            "image_url": ""
        }
    }
]